In [196]:
import pandas as pd

LOADING DATAFRAMES FROM THE FILE

In [197]:
coffee = pd.read_csv("./warmup-data/coffee.csv")

In [198]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [199]:
results = pd.read_parquet("./data/results.parquet")
olympics_data = pd.read_excel("./data/olympics-data.xlsx", sheet_name="bios")

In [200]:
bios = pd.read_csv("./data/bios.csv")

ACCESSING DATA WITH PANDAS

In [201]:
coffee  
#coffee.head() = for displaying first 5 rows
# coffee.tail() = for displaying last 5 rows
# coffee.sample(n=5) = for displaying random 5 rows

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [202]:
#loc[] and iloc[] are used to access specific rows and columns in a DataFrame.
#coffee.loc[Rows, Columns]
coffee.loc[0]

Day              Monday
Coffee Type    Espresso
Units Sold           25
Name: 0, dtype: object

In [203]:
#for multiple rows
coffee.loc[[0,1,8,7]]

        Day Coffee Type  Units Sold
0    Monday    Espresso          25
1    Monday       Latte          15
8    Friday    Espresso          45
7  Thursday       Latte          30

In [204]:
#we acn slicing also 
coffee.loc[0:5]

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35
5  Wednesday       Latte          25

In [205]:
#we can specify the columns also
coffee.loc[0:1, ['Day', 'Coffee Type']]

      Day Coffee Type
0  Monday    Espresso
1  Monday       Latte

In [206]:
#iloc used for integer-location based indexing for selection by position.
coffee.iloc[0:2, [0,2]]

      Day  Units Sold
0  Monday          25
1  Monday          15

In [207]:
#we can change the specific value in the dataframe
coffee.loc[1, "Units Sold"] = 25

In [208]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          25
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [209]:
#iat and at are used to access a single value for a row/column pair by integer position and label respectively.

coffee.iat[1, 2]  # Accessing the value at row index 1 and column index 2
coffee.at[1, "Units Sold"]  # Accessing the value at row label 1 and column label "Units Sold"

np.int64(25)

In [210]:
#GETTING COLUMN NAMES

coffee.Day

0        Monday
1        Monday
2       Tuesday
3       Tuesday
4     Wednesday
5     Wednesday
6      Thursday
7      Thursday
8        Friday
9        Friday
10     Saturday
11     Saturday
12       Sunday
13       Sunday
Name: Day, dtype: object

SORT THE VALUES

In [211]:
coffee.sort_values("Units Sold", ascending = False)

          Day Coffee Type  Units Sold
10   Saturday    Espresso          45
8      Friday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
4   Wednesday    Espresso          35
11   Saturday       Latte          35
13     Sunday       Latte          35
9      Friday       Latte          35
2     Tuesday    Espresso          30
7    Thursday       Latte          30
0      Monday    Espresso          25
5   Wednesday       Latte          25
1      Monday       Latte          25
3     Tuesday       Latte          20

In [212]:
coffee.sort_values(["Units Sold", "Coffee Type"], ascending = [False, True])

          Day Coffee Type  Units Sold
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
4   Wednesday    Espresso          35
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
2     Tuesday    Espresso          30
7    Thursday       Latte          30
0      Monday    Espresso          25
1      Monday       Latte          25
5   Wednesday       Latte          25
3     Tuesday       Latte          20

ITERATE OVER A DATAFRAME WITH FOR LOOP

In [213]:
for index, row in coffee.iterrows():
    print(f"Index: {index}")
    print(f"Row Data:\n{row}\n")

Index: 0
Row Data:
Day              Monday
Coffee Type    Espresso
Units Sold           25
Name: 0, dtype: object

Index: 1
Row Data:
Day            Monday
Coffee Type     Latte
Units Sold         25
Name: 1, dtype: object

Index: 2
Row Data:
Day             Tuesday
Coffee Type    Espresso
Units Sold           30
Name: 2, dtype: object

Index: 3
Row Data:
Day            Tuesday
Coffee Type      Latte
Units Sold          20
Name: 3, dtype: object

Index: 4
Row Data:
Day            Wednesday
Coffee Type     Espresso
Units Sold            35
Name: 4, dtype: object

Index: 5
Row Data:
Day            Wednesday
Coffee Type        Latte
Units Sold            25
Name: 5, dtype: object

Index: 6
Row Data:
Day            Thursday
Coffee Type    Espresso
Units Sold           40
Name: 6, dtype: object

Index: 7
Row Data:
Day            Thursday
Coffee Type       Latte
Units Sold           30
Name: 7, dtype: object

Index: 8
Row Data:
Day              Friday
Coffee Type    Espresso
Units Sold           45
Name: 8, dtype: object

Index: 9
Row Data:
Day            Friday
Coffee Type     Latte
Units Sold         35
Name: 9, dtype: object

Index: 10
Row Data:
Day            Saturday
Coffee Type    Espresso
Units Sold           45
Name: 10, dtype: object

Index: 11
Row Data:
Day            Saturday
Coffee Type       Latte
Units Sold           35
Name: 11, dtype: object

Index: 12
Row Data:
Day              Sunday
Coffee Type    Espresso
Units Sold           45
Name: 12, dtype: object

Index: 13
Row Data:
Day            Sunday
Coffee Type     Latte
Units Sold         35
Name: 13, dtype: object

FILTERING THE DATA

In [214]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [215]:
bios.loc[bios["height_cm"] > 200, ["name", "height_cm"]]

                      name  height_cm
1080        Bozhil Lozanov      208.0
1673      Alexis Rubalcaba      204.0
2647         Milan Šrejber      203.0
2827    Nik'oloz Deriugini      206.0
2832         Elşad Qadaşev      205.0
...                    ...        ...
143784  Daniel Miklasevich      203.0
143833  Garrett Muagututia      205.0
143834         Kyle Ensing      201.0
143835         Mitch Stahl      203.0
143919   Emerson Rodríguez      204.0

[1219 rows x 2 columns]

In [216]:
#syntax without loc
bios[bios["height_cm"] > 200][["name", "height_cm"]]

                      name  height_cm
1080        Bozhil Lozanov      208.0
1673      Alexis Rubalcaba      204.0
2647         Milan Šrejber      203.0
2827    Nik'oloz Deriugini      206.0
2832         Elşad Qadaşev      205.0
...                    ...        ...
143784  Daniel Miklasevich      203.0
143833  Garrett Muagututia      205.0
143834         Kyle Ensing      201.0
143835         Mitch Stahl      203.0
143919   Emerson Rodríguez      204.0

[1219 rows x 2 columns]

In [217]:
#MULTIPLE FILTER CONDITIONS
bios[(bios["height_cm"] > 200) & (bios["weight_kg"] < 100)][["name", "height_cm", "weight_kg"]]

                           name  height_cm  weight_kg
1673           Alexis Rubalcaba      204.0       95.0
2647              Milan Šrejber      203.0       98.0
2837           Brendon Hackwill      204.0       86.0
3267                 Zdeněk Kos      206.0       94.0
3270             Stano Kropilák      208.0       91.0
...                         ...        ...        ...
140025  Konstantinos Englezakis      202.0       90.0
141018            Yuta Watanabe      215.0       97.0
143267              Omar Agrebi      205.0       82.0
143707             Jerami Grant      203.0       95.0
143708             Jayson Tatum      203.0       95.0

[491 rows x 3 columns]

In [218]:
#FILTER BY STRING CONDITIONS
bios[bios["name"].str.contains("Alex | Keith", case = False)]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
644,647,Alex Antonitsch,1966-02-08,Villach,Kärnten,AUT,Austria,188.0,85.0,NaN
3374,3386,Alex Dickson,1962-10-07,Bellshill,Scotland,GBR,Great Britain,177.0,60.0,NaN
3415,3427,Alex Ireland,1901-02-11,Leith,Scotland,GBR,Great Britain,NaN,NaN,1966-01-24
3673,3685,Alex Baba,1970-07-06,Accra,Greater Accra,GHA,Ghana,170.0,51.0,NaN
4199,4213,Alex Stewart,1964-06-28,London,England,GBR,Jamaica,188.0,90.0,2016-11-16
...,...,...,...,...,...,...,...,...,...,...
143836,147492,Alex Wolf,1997-04-19,Anaheim,California,USA,United States,200.0,NaN,NaN
144288,147976,Alex Grant,1989-01-20,Antigonish,Nova Scotia,CAN,Canada,188.0,NaN,NaN
144756,148457,Alex Varnyú,1995-08-01,Budapest,Budapest,HUN,Hungary,179.0,76.0,NaN
144773,148474,Alex Pagnini,1994-04-25,Urbino,Pesaro e Urbino,ITA,Italy,NaN,NaN,NaN
144775,148476,Alex Verginer,1994-10-03,Bressanone,Bolzano-Bozen,ITA,Italy,NaN,NaN,NaN

In [219]:
#vowel_cities = bios[bios['born_city'].str.contains(r'^[AEIOUaeiou]', na=False)]

# Find athletes with names that contain exactly two vowels:
#two_vowels = bios[bios['name'].str.contains(r'^[^AEIOUaeiou]*[AEIOUaeiou][^AEIOUaeiou]*[AEIOUaeiou][^AEIOUaeiou]*$', na=False)]

# Find athletes with names that have repeated consecutive letters (e.g., "Aaron", "Emmett"):
##repeated_letters = bios[bios['name'].str.contains(r'(.)\1', na=False)]

# Find athletes with names ending in 'son' or 'sen':
##son_sen_names = bios[bios['name'].str.contains(r'son$|sen$', case=False, na=False)]

# Find athletes born in a year starting with '19':
##born_19xx = bios[bios['born_date'].str.contains(r'^19', na=False)]

# Find athletes with names that do not contain any vowels:
##no_vowels = bios[bios['name'].str.contains(r'^[^AEIOUaeiou]*$', na=False)]

# Find athletes whose names contain a hyphen or an apostrophe:
##hyphen_apostrophe = bios[bios['name'].str.contains(r"[-']", na=False)]

# Find athletes with names that start and end with the same letter:
##start_end_same = bios[bios['name'].str.contains(r'^(.).*\1$', na=False, case=False)]

# Find athletes with a born_city that has exactly 7 characters:
##city_seven_chars = bios[bios['born_city'].str.contains(r'^.{7}$', na=False)]

# Find athletes with names containing three or more vowels:
##three_or_more_vowels = bios[bios['name'].str.contains(r'([AEIOUaeiou].*){3,}', na=False)]

In [220]:
#Query functions
bios.query('born_country == "USA" and height_cm > 200')[['name', 'born_country', 'height_cm']]

                   name born_country  height_cm
5197       Anne Donovan          USA      203.0
5652        Mike Bantom          USA      203.0
5657         Jim Barnes          USA      201.0
5681       Walt Bellamy          USA      211.0
5709         Larry Bird          USA      205.0
...                 ...          ...        ...
143706      Bam Adebayo          USA      206.0
143707     Jerami Grant          USA      203.0
143710  Khris Middleton          USA      201.0
143712     JaVale McGee          USA      213.0
143733       Nick Allen          USA      203.0

[152 rows x 3 columns]

ADDING AND REMOVING COLUMNS

In [221]:
coffee = pd.read_csv("./warmup-data/coffee.csv")

In [222]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [223]:
coffee['price'] = 200

In [224]:
coffee.head()

         Day Coffee Type  Units Sold  price
0     Monday    Espresso          25    200
1     Monday       Latte          15    200
2    Tuesday    Espresso          30    200
3    Tuesday       Latte          20    200
4  Wednesday    Espresso          35    200

In [225]:
import numpy as np
coffee['new_price'] = np.where(coffee['Coffee Type']=='Espresso', 300, 400)

In [226]:
coffee.head()

         Day Coffee Type  Units Sold  price  new_price
0     Monday    Espresso          25    200        300
1     Monday       Latte          15    200        400
2    Tuesday    Espresso          30    200        300
3    Tuesday       Latte          20    200        400
4  Wednesday    Espresso          35    200        300

In [227]:
coffee.drop(columns = ['price'], inplace=True)
#inplace=True means the changes will be made directly to the original DataFrame without needing to assign it back to coffee.

In [228]:
coffee

          Day Coffee Type  Units Sold  new_price
0      Monday    Espresso          25        300
1      Monday       Latte          15        400
2     Tuesday    Espresso          30        300
3     Tuesday       Latte          20        400
4   Wednesday    Espresso          35        300
5   Wednesday       Latte          25        400
6    Thursday    Espresso          40        300
7    Thursday       Latte          30        400
8      Friday    Espresso          45        300
9      Friday       Latte          35        400
10   Saturday    Espresso          45        300
11   Saturday       Latte          35        400
12     Sunday    Espresso          45        300
13     Sunday       Latte          35        400

In [229]:
coffee['Revenue'] = coffee['Units Sold'] * coffee['new_price']

In [230]:
coffee

          Day Coffee Type  Units Sold  new_price  Revenue
0      Monday    Espresso          25        300     7500
1      Monday       Latte          15        400     6000
2     Tuesday    Espresso          30        300     9000
3     Tuesday       Latte          20        400     8000
4   Wednesday    Espresso          35        300    10500
5   Wednesday       Latte          25        400    10000
6    Thursday    Espresso          40        300    12000
7    Thursday       Latte          30        400    12000
8      Friday    Espresso          45        300    13500
9      Friday       Latte          35        400    14000
10   Saturday    Espresso          45        300    13500
11   Saturday       Latte          35        400    14000
12     Sunday    Espresso          45        300    13500
13     Sunday       Latte          35        400    14000

In [231]:
coffee.rename(columns={'new_price': 'Price'}, inplace=True)

In [232]:
coffee

          Day Coffee Type  Units Sold  Price  Revenue
0      Monday    Espresso          25    300     7500
1      Monday       Latte          15    400     6000
2     Tuesday    Espresso          30    300     9000
3     Tuesday       Latte          20    400     8000
4   Wednesday    Espresso          35    300    10500
5   Wednesday       Latte          25    400    10000
6    Thursday    Espresso          40    300    12000
7    Thursday       Latte          30    400    12000
8      Friday    Espresso          45    300    13500
9      Friday       Latte          35    400    14000
10   Saturday    Espresso          45    300    13500
11   Saturday       Latte          35    400    14000
12     Sunday    Espresso          45    300    13500
13     Sunday       Latte          35    400    14000

In [233]:
bios_new = bios.copy()

In [234]:
bios_new.query('height_cm > 222')[['name', 'height_cm']]

                  name  height_cm
5781    Tommy Burleson      223.0
6978   Arvydas Sabonis      223.0
89070         Yao Ming      226.0

In [235]:
bios_new['born_datetime'] = pd.to_datetime(bios_new['born_date'])

In [236]:
bios_new['born_year'] = bios_new['born_datetime'].dt.year

In [237]:
bios_new[['name','born_year']]

                         name  born_year
0       Jean-François Blanchy     1886.0
1              Arnaud Boetsch     1969.0
2                Jean Borotra     1898.0
3             Jacques Brugnon     1895.0
4                Albert Canet     1878.0
...                       ...        ...
145495      Polina Luchnikova     2002.0
145496    Valeriya Merkusheva     1999.0
145497        Yuliya Smirnova     1998.0
145498         André Foussard     1899.0
145499          Bill Phillips     1913.0

[145500 rows x 2 columns]

In [238]:

bios_new.to_csv('./data/bios_new.csv', index=False)

In [239]:
bios['heigh_category'] = bios['height_cm'].apply(lambda x: 'Tall' if x > 200 else 'Average' if x >= 170 else 'Short')

In [240]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,heigh_category
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Short
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Average
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Average
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Short
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Short

In [241]:
bios = pd.read_csv("./data/bios.csv")

MERGING AND CONCATENATING DATA

In [242]:
nocs = pd.read_csv("./data/noc_regions.csv")

In [243]:
nocs.head()

   NOC       region                 notes
0  AFG  Afghanistan                   NaN
1  AHO      Curacao  Netherlands Antilles
2  ALB      Albania                   NaN
3  ALG      Algeria                   NaN
4  AND      Andorra                   NaN

In [244]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [245]:
bios_new = pd.merge(bios, nocs, left_on='born_country', right_on='NOC', how='inner')

In [246]:
bios_new.rename(columns={'region': 'born_country_full'}, inplace=True)

In [247]:
bios_new.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC_x,height_cm,weight_kg,died_date,NOC_y,born_country_full,notes
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,FRA,France,NaN
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,FRA,France,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,FRA,France,NaN
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,FRA,France,NaN
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,GBR,UK,NaN

HANDLING NULL VALUES

In [248]:
coffee.loc[[2,3], 'Units Sold'] = np.nan

In [249]:
coffee.head()

         Day Coffee Type  Units Sold  Price  Revenue
0     Monday    Espresso        25.0    300     7500
1     Monday       Latte        15.0    400     6000
2    Tuesday    Espresso         NaN    300     9000
3    Tuesday       Latte         NaN    400     8000
4  Wednesday    Espresso        35.0    300    10500

In [250]:
coffee.fillna(25)

          Day Coffee Type  Units Sold  Price  Revenue
0      Monday    Espresso        25.0    300     7500
1      Monday       Latte        15.0    400     6000
2     Tuesday    Espresso        25.0    300     9000
3     Tuesday       Latte        25.0    400     8000
4   Wednesday    Espresso        35.0    300    10500
5   Wednesday       Latte        25.0    400    10000
6    Thursday    Espresso        40.0    300    12000
7    Thursday       Latte        30.0    400    12000
8      Friday    Espresso        45.0    300    13500
9      Friday       Latte        35.0    400    14000
10   Saturday    Espresso        45.0    300    13500
11   Saturday       Latte        35.0    400    14000
12     Sunday    Espresso        45.0    300    13500
13     Sunday       Latte        35.0    400    14000

In [251]:
coffee['Units Sold'].fillna(coffee['Units Sold'].mean())

0     25.000000
1     15.000000
2     34.166667
3     34.166667
4     35.000000
5     25.000000
6     40.000000
7     30.000000
8     45.000000
9     35.000000
10    45.000000
11    35.000000
12    45.000000
13    35.000000
Name: Units Sold, dtype: float64

In [252]:
#interpolate is used to estimate missing values in a dataset by using existing data points to create a continuous function.
coffee['Units Sold'].interpolate()

0     25.000000
1     15.000000
2     21.666667
3     28.333333
4     35.000000
5     25.000000
6     40.000000
7     30.000000
8     45.000000
9     35.000000
10    45.000000
11    35.000000
12    45.000000
13    35.000000
Name: Units Sold, dtype: float64

In [253]:
coffee.loc[[2,3], 'Units Sold'] = np.nan

In [254]:
coffee

          Day Coffee Type  Units Sold  Price  Revenue
0      Monday    Espresso        25.0    300     7500
1      Monday       Latte        15.0    400     6000
2     Tuesday    Espresso         NaN    300     9000
3     Tuesday       Latte         NaN    400     8000
4   Wednesday    Espresso        35.0    300    10500
5   Wednesday       Latte        25.0    400    10000
6    Thursday    Espresso        40.0    300    12000
7    Thursday       Latte        30.0    400    12000
8      Friday    Espresso        45.0    300    13500
9      Friday       Latte        35.0    400    14000
10   Saturday    Espresso        45.0    300    13500
11   Saturday       Latte        35.0    400    14000
12     Sunday    Espresso        45.0    300    13500
13     Sunday       Latte        35.0    400    14000

In [255]:
coffee.dropna(subset=['Units Sold'])

          Day Coffee Type  Units Sold  Price  Revenue
0      Monday    Espresso        25.0    300     7500
1      Monday       Latte        15.0    400     6000
4   Wednesday    Espresso        35.0    300    10500
5   Wednesday       Latte        25.0    400    10000
6    Thursday    Espresso        40.0    300    12000
7    Thursday       Latte        30.0    400    12000
8      Friday    Espresso        45.0    300    13500
9      Friday       Latte        35.0    400    14000
10   Saturday    Espresso        45.0    300    13500
11   Saturday       Latte        35.0    400    14000
12     Sunday    Espresso        45.0    300    13500
13     Sunday       Latte        35.0    400    14000

In [256]:

coffee[coffee['Units Sold'].notna()]

          Day Coffee Type  Units Sold  Price  Revenue
0      Monday    Espresso        25.0    300     7500
1      Monday       Latte        15.0    400     6000
4   Wednesday    Espresso        35.0    300    10500
5   Wednesday       Latte        25.0    400    10000
6    Thursday    Espresso        40.0    300    12000
7    Thursday       Latte        30.0    400    12000
8      Friday    Espresso        45.0    300    13500
9      Friday       Latte        35.0    400    14000
10   Saturday    Espresso        45.0    300    13500
11   Saturday       Latte        35.0    400    14000
12     Sunday    Espresso        45.0    300    13500
13     Sunday       Latte        35.0    400    14000

AGGREGATING THE DATA

In [257]:
bios['born_city'].value_counts()

born_city
Budapest           1378
Moskva (Moscow)     883
Oslo                708
Stockholm           629
Praha (Prague)      600
                   ...
Kirovgrad             1
Pereiaslav            1
Podgornyy             1
Kudepsta              1
Furmanov              1
Name: count, Length: 22368, dtype: int64

In [258]:

bios[bios['born_country']=='USA']['born_region'].value_counts().head(25)

born_region
California              1634
New York                 990
Illinois                 585
Massachusetts            530
Pennsylvania             530
New Jersey               381
Texas                    368
Minnesota                365
Ohio                     328
Michigan                 319
Washington               240
Florida                  235
Wisconsin                209
Colorado                 207
Connecticut              156
Indiana                  150
Oregon                   132
Georgia                  129
Virginia                 121
Maryland                 117
District of Columbia     107
Iowa                     102
Hawaiʻi                   95
Kansas                    94
Oklahoma                  93
Name: count, dtype: int64

GROUP BY IN PANDAS

In [259]:
coffee.groupby(['Coffee Type'])['Units Sold'].sum()

Coffee Type
Espresso    235.0
Latte       175.0
Name: Units Sold, dtype: float64

In [260]:
coffee.groupby(['Coffee Type'])['Units Sold'].sum()

Coffee Type
Espresso    235.0
Latte       175.0
Name: Units Sold, dtype: float64

ADVANCED FUNCTIONALITY

In [262]:
## shift() rank() cumsum() rolling()
latte = coffee[coffee['Coffee Type']=="Latte"].copy()
latte['3day'] = latte['Units Sold'].rolling(3).sum()

In [263]:
latte

          Day Coffee Type  Units Sold  Price  Revenue   3day
1      Monday       Latte        15.0    400     6000    NaN
3     Tuesday       Latte         NaN    400     8000    NaN
5   Wednesday       Latte        25.0    400    10000    NaN
7    Thursday       Latte        30.0    400    12000    NaN
9      Friday       Latte        35.0    400    14000   90.0
11   Saturday       Latte        35.0    400    14000  100.0
13     Sunday       Latte        35.0    400    14000  105.0